child('Вика', 'Фирая').
child('Вика', 'Алексей').
child('Саша', 'Фирая').
child('Саша', 'Алексей').
child('Леша', 'Фирая').
child('Леша', 'Алексей').
child('Фирая', 'Фафзия').
child('Фирая', 'Зуфар').
child('Алексей', 'Алефтина').
child('Алексей', 'Виктор').
child('Ольга', 'Алефтина').
child('Ольга', 'Виктор').
child('Видик', 'Алена').
child('Видик', 'Василий').
child('СергейI', 'Алена').
child('СергейI', 'Василий').
child('Зарина', 'Юлия').
child('Зарина', 'Саид').
child('Самир', 'Юлия').
child('Самир', 'Саид').
child('Слава', 'Ольга').
child('Слава', 'Сергей').
child('Венера', 'Фафзия').
child('Венера', 'Мухарам').
child('Алена', 'Фафзия').
child('Алена', 'АлексейI').
child('Юлия', 'Фафзия').
child('Юлия', 'АлексейI').
child('Серёжа', 'Ольга').
child('Серёжа', 'Михаил').
child('Фафзия', 'Таслия').
child('Фафзия', 'Николай').
child('Роза', 'Таслия').
child('Роза', 'Рафкат').
child('Раис', 'Таслия').
child('Раис', 'Рафкат').
child('Таня', 'Роза').
child('Таня', 'НиколайI').
child('Зуфар', 'Гульсум').
child('Зуфар', 'Искандер').
child('Алефтина', 'Агния').
child('Алефтина', 'Анатолий').
child('Юрий', 'Агния').
child('Юрий', 'Анатолий').
child('Виктор', 'Онисья').
child('Виктор', 'Павел').
child('МихаилI', 'Онисья').
child('МихаилI', 'Павел').
child('Валерий', 'Онисья').
child('Валерий', 'Павел').
child('Надежда', 'Онисья').
child('Надежда', 'Павел').
child('Стас', 'Надежда').
child('Стас', 'МужНадежды').
child('Ирина', 'ЖенаМихаила').
child('Ирина', 'МихаилI').
child('СергейII', 'ЖенаМихаила').
child('СергейII', 'МихаилI').
female('Вика').
male('Саша').
male('Алексей').
female('Фирая').
female('Алена').
male('Зуфар').
female('Фафзия').
female('Юлия').
female('Венера').
female('Ольга').
male('Виктор').
female('Алефтина').
male('Василий').
male('Саид').
male('Дмитрий').
male('Сергей').
male('Слава').
male('Леша').
male('СергейI').
male('Видик').
female('Зарина').
male('Самир').
male('Мухарам').
male('АлексейI').
male('ВикторI').
female('АлефтинаI').
male('Михаил').
male('Серёжа').
male('Николай').
female('Таслия').
male('Рафкат').
female('Роза').
male('Раис').
male('НиколайI').
female('Таня').
female('Гульсум').
male('Искандер').
male('Анатолий').
female('Агния').
male('Юрий').
male('Павел').
female('Онисья').
male('МихаилI').
male('Валерий').
female('Надежда').
male('Стас').
male('МужНадежды').
male('СергейII').
female('ЖенаМихаила').
female('Ирина').


dever(X, Y) :-
 female(X),
 male(Y),
 child(Z, X),
 child(Z, M),
 child(M, P),
 child(Y, P),
 not(child(X, P)),
 not(M = Y).
